public class Task_2_7 {
    public static void main(String[] args) {
        int x = 5;
        int y = 2;
        ++x;
        int c = x * y;
        y--;
        System.out.println("x = " + x);
        System.out.println("y = " + y);
        System.out.println("c = " + c);
    }
}






/*Даны значения: x=5; y=2; c=x*y; Ра
составьте операции инкремента декремента так,
чтобы после выполнения операции (c=x*y) с равнялось 12,
x=равнялось 6, y=1 Выведите полученные значения в консоль. Эта
задача со звёздочкой, необязательна к выполнению, но рекомендую её сделать.*/